{
    "Data": [
        {
            "TYPE": "121",
            "ID": 41012573,
            "GUID": "https://fr.beincrypto.com/?p=515010",
            "PUBLISHED_ON": 1740844800,
            "IMAGE_URL": "https://resources.cryptocompare.com/news/88/41012573.jpeg",
            "TITLE": "3 altcoins méconnus à surveiller en mars",
            "URL": "https://fr.beincrypto.com/marches/515010/altcoins-pepites-cachees-surveiller-mars/",
            "SOURCE_ID": 88,
            "BODY": "Certains altcoins relativement méconnus, DOGEai, SIREN et Nodecoin (NC), se présentent comme trois pépites cachées à surveiller ce mois de mars. DOGEai, construit sur Solana, exploite plusieurs thématiques particulièrement prisées de la crypto, notamment la popularité de Dogecoin et la tendance croissante de l’IA. SIREN, un altcoin du réseau BNB, semble pour sa part prêt à bénéficier de l’élan croissant de BNB, tandis que le token NC s’inscrit dans la “narrative” crypto encore émergente de la DePIN en récompensant ses utilisateurs pour la monétisation d’internet inutilisé. DOGEai (DOGEAI) DOGEai est une crypto d’intelligence artificielle basée sur la blockchain Solana. Sa capitalisation boursière est de 27 millions de dollars, en hausse de 22 % au cours des sept derniers jours. Ce projet capitalise sur plusieurs thématiques, notamment la popularité généralisée du meme coin Dogecoin , l’intérêt croissant pour le D.O.G.E (Department of Government Efficiency), et la tendance des cryptos basées sur l’IA. Analyse du cours de DOGEai. Source : TradingView . Cet altcoin se positionne comme « un agent IA autonome conçu pour identifier les gaspillages et inefficacités dans les dépenses publiques et les décisions politiques », qui fournit par ailleurs des résumés de projets de loi et des aperçus des dépenses publiques. Si la tendance haussière actuelle se poursuit, le cours DOGEai pourrait défier la résistance à 0,048 $, avec des objectifs de hausse potentielle à 0,057 $ et 0,068 $. Une forte tendance haussière pourrait même le pousser à 0,098 $. Au contraire, si une tendance baissière perdure, DOGEai dispose d’un support à 0,029 $. Si ce niveau ne tient pas, le cours pourrait décliner à 0,0119 $. SIRENE SIREN est un altcoin de l’écosystème BNB qui capitalise sur la thématique des cryptos IA. Alors que le réseau BNB gagne à nouveau de l’élan – ayant récemment dépassé Solana en volume de transactions sur 24 heures – certains de ses altcoins, parmi lesquels le SIREN, pourraient bénéficier d’une attention accrue dans les semaines à venir. SIREN affiche actuellement une capitalisation boursière d’environ 40 millions de dollars, ainsi que plus de 22 000 détenteurs, et un volume de transactions quotidien de 1 million de dollars. Analyse du cours de SIREN. Source : Dexscreener . Alors que l’intérêt pour BNB continue de croître, SIREN pourrait en bénéficier considérablement en se positionnant comme une crypto IA de premier plan au sein de l’écosystème BNB, qui reste encore actuellement à la traîne derrière Solana et Base sur ce point. Si SIREN peut établir une forte tendance haussière, il pourrait défier la résistance à 0,089 $, et franchir ce niveau pourrait le pousser plus loin à 0,11 $. Inversement, si la tendance baissière s’intensifie, SIREN pourrait tester le support à 0,051 $, et si ce niveau échoue, il pourrait descendre jusqu’à 0,034 $. Nodecoin (NC) NC est un altcoin basé sur Solana. Il s’agit de la crypto native de Nodepay, une plateforme qui permet à ses utilisateurs de monétiser leur internet inutilisé pour la formation IA et de gagner en échange des récompenses. NC est en hausse de 14 % au cours des sept derniers jours, avec une capitalisation boursière désormais à 14,4 millions de dollars. Jason Brink, PDG de Datagram, souligne que les cryptos DePIN pourraient être l’une des narratives les plus sous-estimés actuellement : « Étant donné le sentiment actuel du marché, les thématiques liées à l’utilité et aux actifs du monde réel s’apprêtent à gagner du terrain alors que les investisseurs recentrent leur attention sur les fondamentaux. Le secteur DePIN est particulièrement bien positionné pour attirer l’attention, englobant des projets dans la communication décentralisée, le calcul en périphérie et la formation IA. Ces réseaux offrent des économies de coûts substantielles et réduisent le gaspillage de ressources, en faisant des alternatives de plus en plus viables aux modèles d’infrastructure traditionnels. De plus, à mesure que le secteur mûrit, des tokenomics durables et des modèles de revenus concrets renforcent non seulement la proposition à long terme de la DePIN, mais alignent également la technologie blockchain avec l’utilité économique du monde réel », a expliqué Brink à BeInCrypto. Analyse du cours de NC. Source : TradingView . Si Nodecoin peut construire une forte tendance haussière, il pourrait monter afin de tester des niveaux aux alentours de 0,1 $. Cependant, si une tendance baissière émerge, il pourrait au contraire tester le support à 0,056 $. Si celui-ci ne tient pas, l’altcoin pourrait alors descendre jusqu’à 0,043 $. Morale de l’histoire : Les altcoins méconnus sont parfois les plus prometteurs.",
            "KEYWORDS": "Marchés|Actualités Altcoins|analyses techniques|Cryptomonnaies",
            "LANG": "FR",
            "UPVOTES": 0,
            "DOWNVOTES": 0,
            "SCORE": 0,
            "SENTIMENT": "POSITIVE",
            "STATUS": "ACTIVE",
            "CREATED_ON": 1740845082,
            "UPDATED_ON": 1740845082,
            "SOURCE_DATA": {
                "TYPE": "120",
                "ID": 88,
                "SOURCE_KEY": "beincrypto",
                "NAME": "BeInCrypto",
                "IMAGE_URL": "https://resources.cryptocompare.com/news/88/default.png",
                "URL": "https://fr.beincrypto.com/feed/",
                "LANG": "FR",
                "SOURCE_TYPE": "RSS",
                "LAUNCH_DATE": 1535760000,
                "SORT_ORDER": 0,
                "BENCHMARK_SCORE": 0,
                "STATUS": "ACTIVE",
                "LAST_UPDATED_TS": 1740854419,
                "CREATED_ON": 1709224125,
                "UPDATED_ON": 1734692916
            },
            "CATEGORY_DATA": [
                {
                    "TYPE": "122",
                    "ID": 5,
                    "NAME": "ALTCOIN",
                    "CATEGORY": "ALTCOIN"
                },
                {
                    "TYPE": "122",
                    "ID": 74,
                    "NAME": "BNB",
                    "CATEGORY": "BNB"
                },
                {
                    "TYPE": "122",
                    "ID": 46,
                    "NAME": "SOL",
                    "CATEGORY": "SOL"
                },
                {
                    "TYPE": "122",
                    "ID": 20,
                    "NAME": "DOGE",
                    "CATEGORY": "DOGE"
                },
                {
                    "TYPE": "122",
                    "ID": 13,
                    "NAME": "BLOCKCHAIN",
                    "CATEGORY": "BLOCKCHAIN"
                }
            ]
        },
        {
            "TYPE": "121",
            "ID": 41010615,
            "GUID": "https://cryptoast.fr/?p=170079",
            "PUBLISHED_ON": 1740841235,
            "IMAGE_URL": "https://resources.cryptocompare.com/news/87/default.png",
            "TITLE": "Voici pourquoi la Banque centrale européenne (BCE) ne comprend toujours pas Bitcoin",
            "URL": "https://cryptoast.fr/voici-pourquoi-banque-centrale-europeenne-bce-comprend-toujours-pas-bitcoin/",
            "SOURCE_ID": 87,
            "BODY": "Alors que la BCE persiste à écarter Bitcoin de ses réserves stratégiques, des chercheurs révèlent des failles profondes dans les théories de Jürgen Schaaf et Ulrich Bindseil. Un malentendu qui pourrait bien brouiller la compréhension du réel potentiel de Bitcoin. Et si Aleš Michl, le gouverneur de la Banque centrale tchèque avait raison ? Peut-être bien qu'étudier Bitcoin ne nous fera aucun mal, peut-être même qu'au contraire, cela nous renforcera. L’article Voici pourquoi la Banque centrale européenne (BCE) ne comprend toujours pas Bitcoin est apparu en premier sur Cryptoast .",
            "KEYWORDS": "Actualité du Bitcoin (BTC)|BCE|Bitcoin|BTC|Christine Lagarde|Jürgen Schaaf",
            "LANG": "FR",
            "UPVOTES": 0,
            "DOWNVOTES": 0,
            "SCORE": 0,
            "SENTIMENT": "NEGATIVE",
            "STATUS": "ACTIVE",
            "CREATED_ON": 1740841246,
            "UPDATED_ON": null,
            "SOURCE_DATA": {
                "TYPE": "120",
                "ID": 87,
                "SOURCE_KEY": "cryptoast",
                "NAME": "Cryptoast",
                "IMAGE_URL": "https://resources.cryptocompare.com/news/87/default.png",
                "URL": "https://cryptoast.fr/feed/",
                "LANG": "FR",
                "SOURCE_TYPE": "RSS",
                "LAUNCH_DATE": 1483228800,
                "SORT_ORDER": 0,
                "BENCHMARK_SCORE": 0,
                "STATUS": "ACTIVE",
                "LAST_UPDATED_TS": 1740854413,
                "CREATED_ON": 1709223858,
                "UPDATED_ON": 1709223886
            },
            "CATEGORY_DATA": [
                {
                    "TYPE": "122",
                    "ID": 14,
                    "NAME": "BTC",
                    "CATEGORY": "BTC"
                }
            ]
        }
    ],
    "Err": {}
}